[
  {
    "weight": 100,
    "title": "(New Chicago) LoE Realm released!",
    "text": "<p>Hello LoE Realm community! After almost 2 years working on it, we are happy to release the source code (working) with client and server of project <strong>LoE Realm</strong> public! Now, if you want a different project to begin, LoE Realm New Chicago version is the right choice for you. Let's check project custom features below:</p><ul><li>Custom pets (activated when used an egg)!</li><li>Custom pets behaviors (your pet being more stronger depending by its tier and your account star amount, also VIPs receive a special bonuses on pets)!</li><li>Custom pets tab (yes! we added a custom pets tab near player's tabs which display all important data of your pet dynamically with a cool interface)!</li><li>Custom items (more than 99+ different items to collect)!</li><li>Custom character screen (a enjoyable character screen interface to display your character data properly and with new icons designed to fit its theme)!</li><li>Custom game appearance (yes! we customized whole game appearance with 8/16bits feeling)!</li><li>Custom HP bar (the game contains a custom HP bar which triggers different colors depending by current player's HP amount)!</li><li>Custom minigames (we rebuild whole mystery box and alchemist system and its so simple to add new offers)!</li><li>Custom store (we implemented an offline store where people who donate to the project can receive a special currency called <strong>Empires Coins</strong> used to purchase special offers at game store)!</li><li>Custom account info (we implemented an account information checker used to display some details of your account)!</li><li>Custom bosses and enemies (we added some fun MOBs in game to entertain your players like Muzzlereaper, Guzzlereaper, Silencer, Lost Prisoner Soul, Eyeguard of Surrender and Nightmare, you must try out an intense battle against them)!</li><li>Custom VIP systems (we added 2 different account types used to grant special permissions for certain players in-game like VIP Account and Legends of LoE Account, but to receive a VIP Account you need to purchase any crown type at game store and use it at Vault to activate it)!</li><li>Custom VIP (you don't need to worry when you need to remove VIP of someone in-game, we already developed a system to revoke player's VIP Account's rights when lifetime of player over)</li><li>Improved client / server update algorithms!</li><li>Improved client / server network algorithms!</li><li>Improved check usage algorithm!</li><li>Improved projectile collision algorithms!</li><li>Improved movement algorithms!</li><li>And so much more! Try out LoE Realm New Chicago version as well, you can download the source code at this <a href=\"https://github.com/Devwarlt/LoE-Realm-NC\" target=\"_blank\">GitHub</a> public repository!</li></ul><p>Hopefully, you enjoy it new PServer developers!</p><p>Special thanks to:</p><ul><li>Devwarlt</li><li>Slendergo</li><li>09 (Demon)</li><li>GhostMaree</li><li>Davy</li><li>Spectralman</li><li>Sebafra</li><li>Nilly</li><li>Kaos</li><li>Creepylava</li><li>PainFX</li><li>Lynx</li><li>Mike</li><li>Miniguy</li><li>Arcanuo</li><li>Filisha</li><li>Dangergun</li><li>Legend</li><li>Blackhat</li><li>Devoceanic</li><li>...and other important developers!</li></ul><p>Kind regards, <strong>LoESoft Games</strong>.</p>",
    "showAtStartup": true,
    "newsKey": "8FmJvOz1AwIYGonX32iX6kLsk6LLGUGxb6WqzpWuNbF6Zh4SCGKY2LLhGyVD8hTC9",
    "platform": "kongregate,steam,rotmg",
    "startTime": 4080326400000
  }
]